{
  "name": "Clan Crafter",
  "source": {
    "Official": "Sword Coast Adventurer's Guide"
  },
  "description": "The Stout Folk are well known for their artisanship and the worth of their handiworks, and you have been trained in that ancient tradition. For years you labored under a dwarf master of the craft, enduring long hours and dismissive, sour-tempered treatment in order to gain the fine skills you possess today.\nYou are most likely a dwarf, but not necessarily- particularly in the North, the shield dwarf clans learned long ago that only proud fools who are more concerned for their egos than their craft turn away promising apprentices, even those of other races. If you aren't a dwarf, however, you have taken a solemn oath never to take on an apprentice in the craft: it is not for non-dwarves to pass on the skills of Moradin's favored children. You would have no difficulty, however, finding a dwarf master who was willing to receive potential apprentices who came with your recommendation.",
  "skill_proficiencies": [
    "History",
    "Insight"
  ],
  "tool_proficiencies": [
    "One type of artisan's tools"
  ],
  "languages": "Dwarvish, or one other of your choice if you already speak dwarvish",
  "equipment": [
    "A set of artisan's tools with which you are proficient",
    "a maker's mark chisel used to mark your handiwork with the symbol of the clan of crafters you learned your skill from",
    "a set of `hover:traveler's clothes|2gp 4lbs`",
    "a `hover:pouch|5sp 1lbs` containing 5gp and a gem worth 10gp"
  ],
  "features": [
    {
      "name": "Respect of the Stout Folk",
      "description": "As well respected as clan crafters are among outsiders, no one esteems them quite so highly as dwarves do. You always have free room and board in any place where shield dwarves or gold dwarves dwell, and the individuals in such a settlement might vie among themselves to determine who can offer you (and possibly your compatriots) the finest accommodations and assistance."
    }
  ]
}